brew "bat"
brew "bottom"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "yq"
brew "zellij"
brew "zoxide"
cask "copilot-cli"
cask "font-fira-code-nerd-font"

{{- if .isWork }}
cask "claude-code"
{{- else }}
tap "anomalyco/tap"
brew "gemini-cli"
brew "anomalyco/tap/opencode"
{{- end }}

{{- if not .isHeadless }}
cask "raycast"
cask "wezterm"
{{- end }}
