brew "bat"
brew "chezmoi"
brew "eza"
brew "fd"
brew "fzf"
brew "gcc"
brew "gh"
brew "ghq"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "starship"
brew "yq"
brew "zoxide"
cask "copilot-cli"
cask "font-fira-code-nerd-font"

{{- if eq .chezmoi.os "darwin" }}
cask "claude-code"
cask "wezterm"
{{- end }}

{{- if eq .chezmoi.os "linux" }}
{{-   if (.chezmoi.kernel.osrelease | lower | contains "microsoft") }}
brew "gemini-cli"
tap "anomalyco/tap"
brew "anomalyco/tap/opencode"
{{-   end }}
{{- end }}
